{"created_at":"2020-03-01T22:22:04.684Z","updated_at":"2020-03-01T22:22:05.706Z","created_by":"elastic","description":"Libraries used by the Iron Python framework were loaded. These are sometimes associated with SILENTTRINITY activity. ","enabled":true,"false_positives":["Authorized applications using the Iron Python framework, if any exist locally, may use these libraries. "],"filters":[],"from":"now-360s","id":"74d3d4b3-8c7c-4f3e-9d48-a49d20ba895e","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"abd6c47d-fc7a-4127-9611-453066ace73c","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Possible SILENTTRINITY Activity","query":"winlog.event_data.OriginalFileName: (IronPython.dll or IronPythonModules.dll) and event.action:\"Image loaded (rule: ImageLoad)\"","references":["https://blog.f-secure.com/hunting-for-silenttrinity/"],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}],"framework":"MITRE ATT&CK"}],"version":1}
{"created_at":"2020-03-01T21:17:19.799Z","updated_at":"2020-03-01T22:24:20.299Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This signal indicates MSBuild was likely launched by a script, either a Powershell or Shell script.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"5fca7163-3dad-45fd-ac99-0c1e906400ae","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4aacb06c-bfaf-426d-9ea9-c73f29d069fe","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"MSBuild Started by a Script","query":"process.name: MSBuild.exe and process.parent.name: (cmd.exe or powershell.exe)","references":["https://github.com/randomuserid/Adama/tree/master/Windows/MSBuild%20and%20Silent%20Trinity"],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1127","name":"Trusted Developer Utilities","id":"T1127"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution","id":"TA0002"}}],"version":6}
{"created_at":"2020-03-01T21:17:19.798Z","updated_at":"2020-03-01T22:12:09.195Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This process is not normally started by Office apps like Word or Excel and may have resulted from the opening of a malicious document.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"a5c9c069-2482-497e-ad73-b654dfd8e092","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"b301844a-76ad-4f09-802c-12184a9f6b9b","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"MSBuild Started by an Office Application","query":"process.name: MSBuild.exe and process.parent.name: (excel.exe or winword.exe)","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1127","name":"Trusted Developer Utilities","id":"T1127"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution","id":"TA0002"}}],"version":3}
{"created_at":"2020-03-01T22:08:36.541Z","updated_at":"2020-03-01T22:12:09.196Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This signal indicates MSBuild attempted to execute code in the memory space of another process. This technique is sometimes used by payloads to evade detection or to elevate privileges. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"5b2e5bf0-b234-4107-8a2e-e77ab23f78d7","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"baf79894-e087-4848-a77a-e4869bf3b913","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Process Injection by MSBuild","query":"process.name:MSBuild.exe and event.action:\"CreateRemoteThread detected (rule: CreateRemoteThread)\"","references":[],"meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1055","name":"Process Injection","id":"T1055"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1055","name":"Process Injection","id":"T1055"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation","id":"TA0004"}}],"version":1}
{"created_at":"2020-03-01T21:55:25.638Z","updated_at":"2020-03-01T22:12:09.205Z","created_by":"elastic","description":"An instance of MSBuild.exe, the MSBuild, the Microsoft Build Engine, changed its name after executing. This is uncommon and may indicate a malicious script or program attempting to go unnoticed or undetected. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"74d2ee93-f9e0-46ba-aec1-d08de38fccb5","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"eb35739c-3e88-4e0e-b6fe-bc07eb361ee4","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Masquerading by MSBuild ","query":"winlog.event_data.OriginalFileName:MSBuild.exe and not process.name: MSBuild.exe","references":[],"meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1036","name":"Masquerading","id":"T1036"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":1}
{"created_at":"2020-03-01T22:04:56.152Z","updated_at":"2020-03-01T22:12:09.195Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This signal indicates MSBuild loaded libraries associated with credential and passwords. This is uncommon any may indicate an attempt at credential dumping. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"bc4461e8-50e7-4269-9f03-1fc30a927bf8","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"592a6075-d098-4a47-9747-90a109b85984","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Possible Credential Dumping by MSBuild","query":"winlog.event_data.OriginalFileName: (vaultcli.dll or samlib.dll) and process.name:MSBuild.exe and event.action:\"Image loaded (rule: ImageLoad)\"","references":[],"meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1003","name":"Credential Dumping","id":"T1003"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access","id":"TA0006"}}],"version":1}
{"created_at":"2020-03-01T21:45:16.846Z","updated_at":"2020-03-01T22:12:09.591Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This signal indicates MSBuild was started by the Microsoft HTML Application Host. This is uncommon and may be the result of execution of malicious code or payloads. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"5064f86c-1f81-4bd1-a0aa-d0eacdeb7485","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"68581c67-dd9a-421f-a728-24fee87b9f3f","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"MSBuild Started by Mshta.exe","query":"process.name: MSBuild.exe and process.parent.name: mshta.exe","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1127","name":"Trusted Developer Utilities","id":"T1127"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution","id":"TA0002"}}],"version":2}
{"created_at":"2020-03-01T21:56:12.804Z","updated_at":"2020-03-01T22:12:09.617Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This signal indicates MSBuild started Internet Explorer; Powershell; or the Visual C# [sharp] Command-Line Compiler. This is uncommon and may indicate an attempt to evade detection or forensics by delivering a malicious payload as uncompiled code. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"21d4eb6d-ca2c-473c-b413-84da88a5d8e7","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"dbd31a26-56c4-4d77-b4ba-b4f7098a8fd9","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Possible Compile After Delivery Technique by MSBuild","query":"process.parent.name: MSBuild.exe and process.name: (csc.exe or iexplore.exe or powershell.exe)","references":[],"meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1500","name":"Compile After Delivery","id":"T1500"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":5}
{"created_at":"2020-03-01T21:45:01.993Z","updated_at":"2020-03-01T22:12:09.677Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This signal indicates MSBuild was started by Explorer, the Windows user interface, which is uncommon and may indicate threat activity. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"4539096f-9775-4987-a159-8b247f323e5d","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6d5280d1-ca85-4035-b467-5b2573e4fbf4","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"MSBuild Started by Explorer","query":"process.name: MSBuild.exe and process.parent.name: explorer.exe","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1127","name":"Trusted Developer Utilities","id":"T1127"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution","id":"TA0002"}}],"version":1}
{"created_at":"2020-03-01T21:50:16.330Z","updated_at":"2020-03-01T22:22:37.866Z","created_by":"elastic","description":"MSBuild, the Microsoft Build Engine, is being increasingly used for execution and persistence. This signal indicates MSBuild was started by the indows Management Instrumentation Provider Service. This is uncommon and may be the result of execution of malicious code or payloads. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"93f5ff5f-47a1-4423-bb71-e886f6991bc1","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"5ef75527-45d5-4953-aab0-035470b1f3cc","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"MSBuild Started by the WMI Service","query":"process.name: MSBuild.exe and process.parent.name: wmiprvse.exe","references":["https://github.com/randomuserid/Adama/tree/master/Windows/MSBuild%20and%20Silent%20Trinity"],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1127","name":"Trusted Developer Utilities","id":"T1127"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution","id":"TA0002"}}],"version":4}
{"exported_count":10,"missing_rules":[],"missing_rules_count":0}
