{"created_at":"2020-03-02T20:14:41.227Z","updated_at":"2020-03-02T20:14:42.247Z","created_by":"elastic","description":"The configuration file for the dynamic linker was modified. This technique is sometimes used for execution, persistence and defense evasion by configuring a malicious library in this file. The specified library will then tend to be invoked during the loading or unloading of legitimate system binaries. This technique was discussed in great detail at Shmoocon 2020 (see reference.) ","enabled":true,"false_positives":["Some Linux applications may normally modify the dynamic linker file. These can be white-listed by process or user name. "],"filters":[],"from":"now-360s","id":"bd1ce1a8-9029-4b62-b70f-3a3f64402ed8","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"c5f3b9aa-7525-44d0-ac0c-13d847d082af","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Dynamic Linker Configuration Change","query":"file.path:\"/etc/ld.so.conf\" and event.action:updated","references":["https://medium.com/forensicitguy/whitelisting-ld-preload-for-fun-and-no-profit-98dfea740b9"],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["linux"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"technique":[{"id":"T1129","name":"Execution through Module Load","reference":"https://attack.mitre.org/techniques/T1129"}],"framework":"MITRE ATT&CK"}],"version":1}
{"created_at":"2020-03-02T20:14:53.797Z","updated_at":"2020-03-02T20:16:56.792Z","created_by":"elastic","description":"A process used arguments containing the path for the dynamic linker configuration file, possibly in an attempt to modify this file. This technique is sometimes used for execution, persistence and defense evasion by configuring a malicious library in this file. The specified library will then tend to be invoked during the loading or unloading of legitimate system binaries. This technique was discussed in great detail at Shmoocon 2020 (see reference.) ","enabled":true,"false_positives":["Some Linux applications may normally modify the dynamic linker file. These can be white-listed by process or user name. "],"filters":[],"from":"now-360s","id":"38a43009-a2f2-429a-b44a-86a99051f35a","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"83ae4f5f-dd1a-48c4-8638-272aa3f9a1d3","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":" Dynamic Linker File in Process Arguments","query":"process.args:\"/etc/ld.so.conf\"","references":["https://medium.com/forensicitguy/whitelisting-ld-preload-for-fun-and-no-profit-98dfea740b9"],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["linux"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1055","name":"Process Injection","id":"T1055"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1129","name":"Execution through Module Load","id":"T1129"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution","id":"TA0002"}}],"version":2}
{"exported_count":2,"missing_rules":[],"missing_rules_count":0}
