{"created_at":"2020-03-04T22:09:24.950Z","updated_at":"2020-03-04T22:09:25.878Z","created_by":"elastic","description":"The Suricata protocol analyzer detected FTP traffic on an unusual port (not TCP 20 or 21.) This could be FTP activity by an uncommon application or it could be data exfiltration trying to go unnoticed. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"d659135c-0e35-4dbe-acc8-e83630324bc0","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"8d6abf87-5e54-4363-bb25-0a4f49f26531","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Internet FTP Traffic on Unusual Port","query":"suricata.eve.alert.signature_id:2610005 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["Network","Suricata"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0010","reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration"},"technique":[{"id":"T1048","name":"Exfiltration Over Alternative Protocol","reference":"https://attack.mitre.org/techniques/T1048"}]},{"tactic":{"id":"TA0010","reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration"},"technique":[{"id":"T1048","name":"Exfiltration Over Alternative Protocol","reference":"https://attack.mitre.org/techniques/T1048"}],"framework":"MITRE ATT&CK"}],"version":1}
{"created_at":"2020-03-04T22:10:46.349Z","updated_at":"2020-03-04T22:16:26.822Z","created_by":"elastic","description":"The Suricata protocol analyzer detected HTTP (web) traffic to an Internet destination that is not using the normal HTTP port. This could be an authorized web application using a non-standard port or an unauthorized web application. If the source and destination cannot be reconciled with any known workflow, this could also be command-and-control activity by a persistence mechanism or malware implant. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"f696d943-2c7c-4d05-bfb9-a04fdfeff829","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"bd1fbc77-e2e3-4861-8678-b62ca7c5548a","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Internet HTTP Traffic on Unusual Port","query":"suricata.eve.alert.signature_id:2610001 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16 and not destination.ip: 169.254.169.254/32","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["Network","Suricata"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1071","name":"Standard Application Layer Protocol","id":"T1071"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1065","name":"Uncommonly Used Port","id":"T1065"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}}],"version":3}
{"created_at":"2020-03-04T22:16:46.393Z","updated_at":"2020-03-04T22:18:55.531Z","created_by":"elastic","description":"The Suricata protocol analyzer detected TLS (encrypted web traffic) to an Internet destination that is not using the normal HTTPS port. This could be an authorized web application using a non-standard port or an unauthorized web application. If the source and destination cannot be reconciled with any known workflow, this could also be command-and-control activity by a persistence mechanism or malware implant. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"4e8b9c30-4b1c-4a64-9247-783dc1b8b907","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"26b75291-ace6-48cd-b92e-7e89f68cd5d6","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Internet TLS Traffic on Unusual Port","query":"suricata.eve.alert.signature_id:2610003 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16 and not destination.ip: 169.254.169.254/32","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["Network","Suricata"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1071","name":"Standard Application Layer Protocol","id":"T1071"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1065","name":"Uncommonly Used Port","id":"T1065"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}}],"version":4}
{"created_at":"2020-03-04T22:19:39.969Z","updated_at":"2020-03-04T22:25:50.295Z","created_by":"elastic","description":"The Suricata protocol analyzer detected SSH (secure shell) to an Internet destination not using the normal SSH port. This could be remote access activity to a Linux server using non-standard ports or it could be unauthorized SSH activity. Because the SSH protocol is so versatile, it can be used for many tactics including persistence, network connection tunneling or forwarding, and data exfiltration. Endpoint logs  from the source would tend to indicate what kind of command or program activity was utilizing the SSH protocol. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"41baafdd-6508-4d62-809b-ac36122f7d90","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"8b9d141e-7ae4-431d-a320-381768c05c4f","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Internet SSH Traffic on Unusual Port","query":"suricata.eve.alert.signature_id:2610007 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["Network","Suricata"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1071","name":"Standard Application Layer Protocol","id":"T1071"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1065","name":"Uncommonly Used Port","id":"T1065"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}}],"version":5}
{"created_at":"2020-03-04T22:27:04.350Z","updated_at":"2020-03-04T22:30:09.932Z","created_by":"elastic","description":"The Suricata protocol analyzer detected IMAP (Internet message access protocol) email activity to an Internet destination not using the normal IMAP port. This is uncommon and may be an attempt to engage in email activity undetected. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"add9342f-72b5-451a-873c-1f1df355a6d0","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"541b508b-9334-42ca-bbdf-9ca015402d54","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Internet IMAP Traffic on Unusual Port","query":"suricata.eve.alert.signature_id:2610009 and not destination.ip:10.0.0.0/8 and not destination.ip:172.16.0.0/12 and not destination.ip:192.168.0.0/16","references":[],"meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["Network","Suricata"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1071","name":"Standard Application Layer Protocol","id":"T1071"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1065","name":"Uncommonly Used Port","id":"T1065"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}}],"version":6}
{"created_at":"2020-03-04T22:47:21.587Z","updated_at":"2020-03-04T23:00:24.655Z","created_by":"elastic","description":"A remote code execution (RCE) exploit for Microsoft Exchange (CVE-2020-0688) exploit was detected by a Suricata sensor. If the target server is unpatched and no intrusion prevention devices interceded, there may have been a successful exploitation. Create a timeline or start live response in order to perform an intrusion analysis. Endpoint event logs or may tend to indicate what, if any, payload was detonated on the target server instance. Look also for additional signals involving execution, persistence or C2 involving the destination server instance. For example, if the signal named \"Command Shell Started by IIS Worker\" also evaluated true on the target Exchange server, examine the process execution logs to determine what commands were executed by the web server.","enabled":true,"false_positives":["If the source is an authorized security scanner or tester, this may not be threat activity. If Exchange is not running on the target, the risk may be low."],"filters":[],"from":"now-360s","id":"f4e47db7-afb7-4343-aef1-b15a66335eb2","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"6c30a519-d729-4936-a764-bfd673c39f36","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Exchange Exploit Activity - CVE-2020-0688","query":"suricata.eve.alert.signature_id:2029540","references":["https://www.thezdi.com/blog/2020/2/24/cve-2020-0688-remote-code-execution-on-microsoft-exchange-server-through-fixed-cryptographic-keyscve","https://www.trustedsec.com/blog/detecting-cve-20200688-remote-code-execution-vulnerability-on-microsoft-exchange-server/"],"meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["Suricata","Windows"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1190","name":"Exploit Public-Facing Application","id":"T1190"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access","id":"TA0001"}}],"version":4}
{"created_at":"2020-03-04T22:53:25.936Z","updated_at":"2020-03-04T23:02:10.752Z","created_by":"elastic","description":"A remote code execution (RCE) exploit for Microsoft SQL Reporting Services (CVE-2020-0618) exploit was detected by a Suricata sensor. If the target server is unpatched and no intrusion prevention devices interceded, there may have been a successful exploitation. Create a timeline or start live response in order to perform an intrusion analysis. Endpoint event logs or may tend to indicate what, if any, payload was detonated on the target server instance. Look also for additional signals involving execution, persistence or C2 involving the destination server instance. ","enabled":true,"false_positives":["If the source is an authorized security scanner or tester, this may not be threat activity. If SQL Reporting Services are not running on the target, the risk may be low."],"filters":[],"from":"now-360s","id":"cc11f073-53ce-4cfc-acb7-d4c179d69826","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"54d81c9b-0836-460c-accb-c6f1f0e13366","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Microsoft SQL Reporting Services Exploit Activity - CVE-2020-0618","query":"suricata.eve.alert.signature_id:2029476","references":["https://www.tenable.com/blog/cve-2020-0618-proof-of-concept-for-microsoft-sql-server-reporting-services-vulnerability"],"meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["Suricata","Windows"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1190","name":"Exploit Public-Facing Application","id":"T1190"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access","id":"TA0001"}}],"version":5}
{"created_at":"2020-03-04T22:46:08.489Z","updated_at":"2020-03-04T23:01:22.714Z","created_by":"elastic","description":"Ghostcat (CVE-2020-1938) exploit activity was detected by a Suricata sensor. If the target server is unpatched and no intrusion prevention devices interceded, there may have been a successful exploitation. Create a timeline or start live response in order to perform an intrusion analysis. Endpoint event logs or may tend to indicate what, if any, payload was detonated on the target server instance. Look also for additional signals involving execution, persistence or C2 involving the destination server instance.","enabled":true,"false_positives":["If the source is an authorized security scanner or tester, this may not be threat activity. If Tomcat is not running on the target, the risk may be low."],"filters":[],"from":"now-360s","id":"1e8b9600-df03-4ac4-a2e1-faf248d75b9b","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"bfd4fddd-565c-4b3e-973f-32e7cbe5fbed","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Ghostcat Exploit Detected","query":"suricata.eve.alert.signature_id:2029533","references":["http://www.tenable.com/blog/cve-2020-1938-ghostcat-apache-tomcat-ajp-file-readinclusion-vulnerability-cnvd-2020-10487"],"meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["Suricata","Linux"],"to":"now","type":"query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1190","name":"Exploit Public-Facing Application","id":"T1190"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access","id":"TA0001"}}],"version":2}
{"exported_count":8,"missing_rules":[],"missing_rules_count":0}
