{"created_at":"2020-03-29T02:20:17.518Z","updated_at":"2020-03-29T02:20:18.569Z","created_by":"elastic","description":"A process injected code into Winlogbeat. This is not normal behavior and may indicate attempts at tampering with Winlogbeat or its message queue. ","enabled":true,"false_positives":[],"from":"now-360s","id":"b4d9e73d-49bd-4576-bd9a-9490fe0cac77","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7643cc80-3ede-4b95-84bf-86de5515ddcb","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":99,"name":"Defense Evasion via Winlogbeat Process Injection","query":"winlog.event_data.TargetImage:*winlogbeat.exe and event.action:\"CreateRemoteThread detected (rule: CreateRemoteThread)\"","references":["https://github.com/randomuserid/Adama/tree/master/Windows/Windows%20Pipeline%20Tampering"],"saved_id":"Winlogbeat injection","meta":{"from":"1m"},"severity":"critical","updated_by":"elastic","tags":["Windows"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}],"framework":"MITRE ATT&CK"}],"version":1}
{"created_at":"2020-03-29T02:27:33.278Z","updated_at":"2020-03-29T02:28:59.696Z","created_by":"elastic","description":"A Winlogbeat configuration file was changed. If this was unexpected, this could be a attempt to surgically disable certain classes of events in order to evade detection by reducing Winlogbeat output rather than taking the more obvious step of killing the process.","enabled":true,"false_positives":["Configuration management tools and processes may change this file. Authorized administrators may change this file. "],"from":"now-360s","id":"c170cf21-c478-4774-9b79-d79253aef887","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"76c2b89c-a8c6-48eb-8b84-4b8b8341e4c3","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Winlogbeat Configuration Change","query":"event.action: \"File created (rule: FileCreate)\" and file.path: *winlogbeat* and *yml","references":[],"saved_id":"Sysmon Configuration Change","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["Windows"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":2}
{"created_at":"2020-03-29T02:26:52.782Z","updated_at":"2020-03-29T02:31:38.006Z","created_by":"elastic","description":"A Sysmon process was terminated. If this was unexpected, this could be a attempt to evade detection by shutting off the Sysmon event logs. ","enabled":true,"false_positives":["Configuration management tools and processes may change this file. Authorized administrators may change this file. "],"from":"now-360s","id":"806b96a5-2318-40aa-ab8c-f01fc25d8198","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ac4d61d0-84d3-4130-8b53-02f3a9f3d987","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Sysmon Process Terminated","query":"process.name: (Sysmon64.exe or Sysmon.exe) and event.action: \"Process terminated (rule: ProcessTerminate)\"","references":[],"saved_id":"Sysmon Configuration Change","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["Windows"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":2}
{"created_at":"2020-03-29T02:32:36.297Z","updated_at":"2020-03-29T02:33:30.556Z","created_by":"elastic","description":"A Sysmonconfiguration file was changed. If this was unexpected, this could be a attempt to surgically disable certain classes of events in order to evade detection by reducing Sysmon output rather than taking the more obvious step of killing the process.","enabled":true,"false_positives":["Configuration management tools and processes may change this file. Authorized administrators may change this file. "],"from":"now-360s","id":"daca5bd5-881a-4a6b-90bc-bd1f5f896a1f","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"53a7ab74-6a2e-46e3-90f2-c1444ca9a1c9","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Sysmon Configuration Change","query":"event.action: \"File created (rule: FileCreate)\" and file.path: *Sysmon* and *xml","references":[],"saved_id":"Sysmon Configuration Change","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["Windows"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"created_at":"2020-03-29T02:34:07.595Z","updated_at":"2020-03-29T02:35:09.849Z","created_by":"elastic","description":"A Winlogbeat process was terminated. If this was unexpected, this could be a attempt to evade detection by shutting off the Sysmon event logs. ","enabled":true,"false_positives":["Configuration management tools and processes may change this file. Authorized administrators may change this file. "],"from":"now-360s","id":"37704842-2b2f-46cc-8aaf-21386636bec6","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"09ad8b01-889e-442f-9c54-178dea732abc","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Winlogbeat Process Terminated","query":"process.name:winlogbeat.exe and event.action: \"Process terminated (rule: ProcessTerminate)\"","references":[],"saved_id":"Sysmon Configuration Change","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["Windows"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"exported_count":5,"missing_rules":[],"missing_rules_count":0}
