{"created_at":"2020-03-15T23:15:42.564Z","updated_at":"2020-03-15T23:15:43.593Z","created_by":"elastic","description":"A trail was deleted. Trails are often deleted by threat actors in order to go undetected. ","enabled":true,"false_positives":[],"from":"now-360s","id":"9ee32958-47f2-404c-bc94-03a3d150a008","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"39f1937b-2e83-4a28-9213-aeb081079682","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"CloudTrail Deleted","query":"event.action: DeleteTrail and event.dataset:aws.cloudtrail","references":[],"saved_id":"CloudTrail Deleted","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1089","name":"Disabling Security Tools","reference":"https://attack.mitre.org/techniques/T1089"}]}],"version":1}
{"created_at":"2020-03-15T23:17:21.272Z","updated_at":"2020-03-15T23:18:20.808Z","created_by":"elastic","description":"A trail was minimized. Trails are often minimized by threat actors in order to go undetected. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"8a120049-948e-4eaa-bd3d-b171bec7d038","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"f9b28a26-f5ab-4692-b04a-fc39d2ae022f","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"CloudTrail Mimimized","query":"event.action: UpdateTrail and event.dataset:aws.cloudtrail","references":[],"saved_id":"CloudTrail Minimized","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"created_at":"2020-03-15T23:16:14.627Z","updated_at":"2020-03-15T23:16:56.686Z","created_by":"elastic","description":"A trail was disabled. Trails are often disabled by threat actors in order to go undetected. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"8cb1fdd6-c1a6-4b1d-9717-03f1d8811d7d","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"546e3c5a-082c-47be-9bc0-c10ad0766307","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"CloudTrail Disabled","query":"event.action: StopLogging and event.dataset:aws.cloudtrail","references":[],"saved_id":"CloudTrail Disabled","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":2}
{"created_at":"2020-03-15T23:22:32.712Z","updated_at":"2020-03-15T23:22:33.739Z","created_by":"elastic","description":"Elements of the AWS Config service were deleted. Threat actors sometimes do this in order to disable security systems that might get in their way.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"5f120a4a-36dc-4259-aff8-2ad35a807c51","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"d201be22-e8c0-47b9-bd41-90646e3b2d86","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"AWS Config Elements Deleted","query":"event.action: (DeleteAggregationAuthorization  or DeleteConfigRule or DeleteConfigurationAggregator or DeleteConfigurationRecorder or DeleteConformancePack or DeleteDeliveryChannel or DeleteEvaluationResults or DeleteOrganizationConfigRule or DeleteOrganizationConformancePack or or DeletePendingAggregationRequest or DeleteRemediationConfiguration or DeleteRemediationExceptions) and event.dataset:aws.cloudtrail","references":[],"saved_id":"AWS Config Service Change","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1089","name":"Disabling Security Tools","reference":"https://attack.mitre.org/techniques/T1089"}]}],"version":1}
{"created_at":"2020-03-15T23:27:12.569Z","updated_at":"2020-03-15T23:27:13.112Z","created_by":"elastic","description":"An EC2 instance was modified by a client with a user agent matching Pacu, the open source AWS exploitation framework.","enabled":true,"false_positives":["Authorized security tests may produce this activity. "],"from":"now-360s","id":"773d3ed4-d857-41f9-9e29-eb64c9b5ab60","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"e9d62854-5c26-4dcd-80a1-f1f57ec3fcde","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":73,"name":"EC2 Instance Modified by Pacu","query":"event.action: ModifyInstanceAttribute and event.dataset:aws.cloudtrail and user_agent.name: Boto3","references":[],"saved_id":"EC2 Instance Modified by Pacu","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":1}
{"created_at":"2020-03-15T23:36:53.474Z","updated_at":"2020-03-15T23:36:54.507Z","created_by":"elastic","description":"User data was modified for an EC2 instance. Check that the calling account is authorized to modify user data. If the mods are unexpected, check for suspicious scripts in the instance user data.","enabled":true,"false_positives":[],"from":"now-360s","id":"15102f1b-6eab-4e56-98d2-64fdfddce966","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"0353660f-12f8-4b52-a1c8-9491c79b593d","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"EC2 Instance User Data Modified","query":"event.action: ModifyInstanceAttribute and event.dataset:aws.cloudtrail and aws.cloudtrail.request_parameters: *userData*","references":[],"saved_id":"EC2 Instance User Data Modified","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"technique":[{"id":"T1064","name":"Scripting","reference":"https://attack.mitre.org/techniques/T1064"}]}],"version":1}
{"created_at":"2020-03-15T23:40:38.606Z","updated_at":"2020-03-15T23:40:39.245Z","created_by":"elastic","description":"An AWS access key was created by a client with a user agent matching Pacu, the open source AWS exploitation framework.","enabled":true,"false_positives":[],"from":"now-360s","id":"34e61b3b-dff3-45ea-a6aa-f220bbd4d79d","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"7aadd736-e26f-4093-9b46-901aa272e2f2","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":74,"name":"AWS Access Key Created by Pacu","query":"event.action: CreateAccessKey and event.dataset:aws.cloudtrail and user_agent.name: Boto3","references":[],"saved_id":"AWS Access Key Created by Pacu","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098"}]},{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098"}],"framework":"MITRE ATT&CK"}],"version":1}
{"created_at":"2020-03-15T23:44:06.802Z","updated_at":"2020-03-15T23:44:07.845Z","created_by":"elastic","description":"An AWS database was restored from a snapshot. This is sometimes done by threat actors to stage data for exfiltration. Check if this activity is normal for the user account and / or calling instance. ","enabled":true,"false_positives":[],"from":"now-360s","id":"a613a9bb-a8c7-4a24-84eb-88e032932209","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"4f99242e-faae-4b49-9dd5-de6a877d5b40","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":25,"name":"AWs Database Restored From Snapshot","query":"event.action: ModifyDBInstance and event.dataset:aws.cloudtrail","references":[],"saved_id":"AWs Database Restored From Snapshot","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0010","reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration"},"technique":[{"id":"T1020","name":"Automated Exfiltration","reference":"https://attack.mitre.org/techniques/T1020"}]}],"version":1}
{"created_at":"2020-03-15T23:48:45.999Z","updated_at":"2020-03-15T23:48:46.749Z","created_by":"elastic","description":"A root user was active in an AWS account. In many environments root account usage is unusual. If the root account usage is unexpected, this could be a threat actor persisting in an account of elevating privileges. ","enabled":true,"false_positives":[],"from":"now-360s","id":"1ffb6e9f-534d-45ac-a636-eccb1c20565d","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"07b51c3d-817d-46cd-adf2-a9a0ed82498a","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":48,"name":"AWS Root Account Activity","query":"aws.cloudtrail.user_identity.type: Root and event.dataset:aws.cloudtrail","references":[],"saved_id":"AWS Root Account Activity","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}],"framework":"MITRE ATT&CK"},{"tactic":{"id":"TA0001","reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}],"framework":"MITRE ATT&CK"}],"version":1}
{"created_at":"2020-03-15T23:58:06.475Z","updated_at":"2020-03-15T23:59:17.605Z","created_by":"elastic","description":"Flow logs were deleted. These are often deleted by threat actors in order for virtual network activity to go undetected. ","enabled":true,"false_positives":[],"from":"now-360s","id":"6d0b775d-35ee-4234-85ca-2aa0d941f699","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"56612981-10ed-43e6-9bf3-82e4aeb675db","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Flow Logs Deleted","query":"event.action: DeleteFlowLogs and event.dataset:aws.cloudtrail","references":[],"saved_id":"Flow Logs Deleted","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":2}
{"created_at":"2020-03-15T23:57:17.405Z","updated_at":"2020-03-16T00:10:54.492Z","created_by":"elastic","description":"IAM policies were enumerated for a user or users. If this is unexpected behavior for the calling user or instance, this could be a threat actor attempting to enumerate the privileges they currently possess or identify avenues of privilege elevation. ","enabled":true,"false_positives":[],"from":"now-360s","id":"8bc183e4-ebb9-4a6b-b9bd-ce6be912bd3f","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"edb1e511-b295-4d9d-ba37-63742775cf46","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":51,"name":"IAM Enumeration","query":"event.action: (GetAccountPasswordPolicy or GetUser or GetEnrollmentStatus or GetPolicy or GetPolicyVersion or ListUserPolicies or ListGroupsForUser or ListAttachedUserPolicies) and event.dataset:aws.cloudtrail","references":[],"saved_id":"IAM Enumeration","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":2}
{"created_at":"2020-03-16T00:15:51.544Z","updated_at":"2020-03-16T00:18:27.806Z","created_by":"elastic","description":"CloudTrail events contain a user agent matching Pacu, the open source AWS exploitation framework.","enabled":true,"false_positives":["Authorized security tests may produce this activity. "],"from":"now-360s","id":"4ae829e0-d2a7-46d1-bda1-217c5ce1c20d","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"7f910fc1-c602-484e-a0d5-29ee7b8d4868","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":51,"name":"Pacu Activity in CloudTrail logs","query":"user_agent.name: Boto3 and event.dataset:aws.cloudtrail","references":["https://github.com/RhinoSecurityLabs/pacu"],"saved_id":"Pacu Activity in AWS CloudTrail Logs","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":2}
{"created_at":"2020-03-16T00:23:29.208Z","updated_at":"2020-03-16T00:23:30.247Z","created_by":"elastic","description":"An AWS user logged in without using multi-factor authentication (MFA). This is a security policy violation in many organizations. ","enabled":true,"false_positives":[],"from":"now-360s","id":"e1e93f72-e906-471c-b14d-de2fa284136b","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"6e55047b-0cb4-4a8e-8c35-04ca5c44c7de","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":25,"name":"AWS User Authenticated Without MFA","query":"aws.cloudtrail.user_identity.session_context.mfa_authenticated: false and event.dataset:aws.cloudtrail","references":[],"saved_id":"AWS User Authenticated Without MFA","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":1}
{"created_at":"2020-03-16T00:30:27.689Z","updated_at":"2020-03-16T00:31:21.858Z","created_by":"elastic","description":"The metadata service is sometimes interrogated in order to enumerate information or harvest credentials. Check if the calling process and / or user context is an expected metadata consumer. Note: this is the one rule in this set that needs Auditbeat data, not CloudTrail data.","enabled":true,"false_positives":[],"from":"now-360s","id":"5a8c9ab3-2bb4-43bc-bcf3-d9efc6868dba","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"1bcccd17-c1c4-4d7d-8ff6-fb3e9ace2430","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":25,"name":"Unusual Process Calling Metadata Service","query":"destination.ip: 169.254.169.254 and not process.name: (\"amazon-ssm-agen\" or aws or filebeat)","references":["https://twitter.com/RhinoSecurity/status/1159936327770681346?s=20","https://twitter.com/0xdabbad00/status/1158456395504611329?s=20"],"saved_id":"Unusual Process Calling Metadata Service","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1522","name":"Cloud Instance Metadata API","id":"T1522"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access","id":"TA0006"}}],"version":2}
{"created_at":"2020-03-16T00:34:11.093Z","updated_at":"2020-03-16T00:34:11.811Z","created_by":"elastic","description":"A security group was created or modified to allow access from any source IP address. This is usually only normal activity for Internet facing web services or bastion hosts.","enabled":true,"false_positives":[],"from":"now-360s","id":"5f8e11bc-8eae-45d7-8962-b9b896cdd2b1","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"88c4e9cf-5670-4a20-971c-50e32c047337","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Security Group Allowing Any Source IP","query":"event.action: AuthorizeSecurityGroupIngress and event.module:aws and aws.cloudtrail.request_parameters: */0*","references":[],"saved_id":"Security Group Allowing Any Source IP","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":1}
{"created_at":"2020-03-16T00:34:29.139Z","updated_at":"2020-03-16T00:42:24.371Z","created_by":"elastic","description":"A security group was created or modified to allow access using any protocol. This is unusual activity except possibly for some dev / test environments.","enabled":true,"false_positives":[],"from":"now-360s","id":"659ff03d-df4c-425c-b454-cf84f6eeb8ce","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"5f26bfef-d6ca-4b42-9c4a-4783f8d1cd19","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Security Group Allowing Any Protocol","query":"event.action: AuthorizeSecurityGroupIngress and event.module:aws and *ipProtocol* and *1*","references":[],"saved_id":"Security Group Allowing Any Protocol","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":2}
{"created_at":"2020-03-16T00:46:10.606Z","updated_at":"2020-03-16T00:48:29.827Z","created_by":"elastic","description":"One or more configuration elements of the AWS WAF service were deleted. Threat actors sometimes delete these in order to disable protections for web applications. ","enabled":true,"false_positives":[],"from":"now-360s","id":"d1da004c-d48b-460e-a10b-bbac797dca42","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"99b2d038-7f84-42cd-997b-fe7b3618ec11","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":49,"name":"AWS WAF Service Configuration Elements Deleted","query":"event.action: (DeleteByteMatchSet or DeleteGeoMatchSet or DeleteIPSet or DeleteLoggingConfiguration or DeletePermissionPolicy or DeleteRegexMatchSet or DeleteRegexPatternSet or DeleteRateBasedRule or DeleteRule or DeleteRuleGroup or DeleteSizeConstraintSet or DeleteSqlInjectionMatchSet or DeleteWebACL or DeleteXssMatchSet or DisassociateWebACL) and event.dataset:aws.cloudtrail","references":[],"saved_id":"AWS WAF Configuration Changes or Deletions","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":2}
{"created_at":"2020-03-16T00:48:41.830Z","updated_at":"2020-03-16T00:50:17.951Z","created_by":"elastic","description":"One or more configuration elements of the AWS Config service were deleted. Threat actors sometimes delete these in order to disable detection and / or protections for mis-configurations and security holes. ","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"bfcf42c0-57af-4990-b659-d5c8f0ad4f43","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"1313d4bc-2a36-488a-b458-d42c141a7a95","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":49,"name":"AWS Config Service Configuration Elements Deleted","query":"event.action: (DeleteAggregationAuthorization  or DeleteConfigRule or DeleteConfigurationAggregator or DeleteConfigurationRecorder or DeleteConformancePack or DeleteDeliveryChannel or DeleteEvaluationResults or DeleteOrganizationConfigRule or DeleteOrganizationConformancePack or or DeletePendingAggregationRequest or DeleteRemediationConfiguration or DeleteRemediationExceptions) and event.dataset:aws.cloudtrail","references":[],"saved_id":"AWS Config Service Change","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"created_at":"2020-03-16T00:50:42.949Z","updated_at":"2020-03-16T00:53:26.192Z","created_by":"elastic","description":"AWS WAF service configuration or policy was enumerated. This is unusual behavior for most users and applications and is sometimes undertaken by threat actors in order to identify what protections are and are not in place for a web application or service.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"866c1dba-6b78-4e97-aab5-73706baa63a5","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"59d8d4da-cdc8-48ed-8134-c855a354f9e3","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":51,"name":"AWS WAF Enumeration","query":"event.action: (ListByteMatchSets or ListGeoMatchSets or ListIPSets or ListRateBasedRules or ListRegexMatchSets or ListRegexPatternSets or ListRuleGroups or ListRules or ListSizeConstraintSets or ListSqlInjectionMatchSets or ListSubscribedRuleGroups or ListWebACLs or ListXssMatchSets) and event.dataset:aws.cloudtrail","references":[],"saved_id":"AWS WAF Service Enumeration","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":3}
{"created_at":"2020-03-16T00:56:08.355Z","updated_at":"2020-03-16T00:57:34.532Z","created_by":"elastic","description":"An AWS Database instance was modified by a client with a user agent matching Pacu, the open source AWS exploitation framework.","enabled":true,"false_positives":["Authorized security tests may produce this activity. "],"from":"now-360s","id":"e4c350f6-cfdf-49f4-b2f2-db91a6121198","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"386220f4-5382-4de2-b053-1accb8944238","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":73,"name":"AWS Database Instance Modified by Pacu","query":"event.action: ModifyDBInstance and event.dataset:aws.cloudtrail and user_agent.name: Boto3","references":[],"saved_id":"Database Instance Modified by Pacu","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":2}
{"created_at":"2020-03-07T23:56:09.363Z","updated_at":"2020-03-16T01:40:26.039Z","created_by":"elastic","description":"A snapshot 's attributes were modified. If the permissions were modified, verify the snapshot was not shared with an unauthorized or unexpected AWS account. This information will be in the 'aws.cloudtrail.request_parameters' field in the ModifySnapshotAttribute event. If the snapshot has been shared, the filed will resemble this example, with the destitution AWS account number as the last parameter: \n\n{snapshotId=snap-2cac8bf2, attributeType=CREATE_VOLUME_PERMISSION, createVolumePermission={add={items=[{userId=010101010101}]}}}","enabled":true,"false_positives":[],"from":"now-360s","id":"ca290826-8432-4bfe-83d9-ad7c2c216c6b","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"e3fcb632-7138-4cae-a803-7cc858ad470e","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"EC2 Snapshot Attribute Modification","query":"event.action: ModifySnapshotAttribute and event.module:aws","references":[],"saved_id":"ModifySnapshotAttribute","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1537","name":"Transfer Data to Cloud Account","id":"T1537"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration","id":"TA0010"}}],"version":3}
{"created_at":"2020-03-16T00:21:12.926Z","updated_at":"2020-03-16T01:41:30.855Z","created_by":"elastic","description":"Changes were made to the public access policy for an S3 bucket. If these changes are unauthorized, check that the public access settings on the S3 bucket meet expectations. ","enabled":true,"false_positives":[],"from":"now-360s","id":"ccd2bfb7-0e02-460f-9017-4326ed69d3e5","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"944865d0-4b6e-487a-8775-b63db2db767c","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":22,"name":"S3 Bucket Public Access Policy Change","query":"event.action: PutBucketPublicAccessBlock and event.dataset:aws.cloudtrail","references":[],"saved_id":"S3 Bucket Public Access Policy Change","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":["aws","cloud"],"to":"now","type":"saved_query","threat":[],"version":2}
{"exported_count":22,"missing_rules":[],"missing_rules_count":0}
