{"created_at":"2020-04-19T20:47:39.659Z","updated_at":"2020-04-19T20:47:40.701Z","created_by":"elastic","description":"Discovery - Virtual Machine Fingerprinting","enabled":true,"false_positives":[],"from":"now-360s","id":"f5832d44-9864-4c15-bd08-3d10f5a43e1d","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"068609d4-b252-4151-9abc-cd17edf1faf2","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Discovery - Virtual Machine Fingerprinting","query":"process.args: (\"/sys/class/dmi/id/bios_version\" or \"/sys/class/dmi/id/product_name\" or \"/sys/class/dmi/id/chassis_vendor\" or \"/proc/scsi/scsi\" or \"/proc/ide/hd0/model\") or process.name: (dmidecode or lscpu or lspci) and event.action:executed","references":[],"saved_id":"Discovery - Virtual Machine Fingerprinting","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"technique":[{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082"}]}],"version":1}
{"created_at":"2020-04-19T20:53:14.240Z","updated_at":"2020-04-19T20:54:13.377Z","created_by":"elastic","description":"Linux System Owner / User Discovery\n","enabled":true,"false_positives":[],"from":"now-360s","id":"736ad3a3-1ee6-43e8-80f1-7b6ffec9c7af","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"4bd61a21-3a7b-4404-b612-9eb893942d5c","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":25,"name":"Linux System Owner / User Discovery","query":"process.name: (users or w or who) and event.action:executed","references":[],"saved_id":"Linux System Owner / User Discovery","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1033","name":"System Owner/User Discovery","id":"T1033"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery","id":"TA0007"}}],"version":2}
{"created_at":"2020-04-19T21:42:57.963Z","updated_at":"2020-04-19T21:44:26.339Z","created_by":"elastic","description":"Defense Evasion - Attempt to Disable SELinux","enabled":true,"false_positives":[],"from":"now-360s","id":"37c9d714-18f8-49fc-ac27-97076f88ccce","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"899de34d-6244-48b6-ba19-9fe6f4614dc4","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Defense Evasion - Attempt to Disable SELinux","query":"process.name: setenforce and process.args: 0 and event.action:executed","references":[],"saved_id":"Defense Evasion - Attempt to Disable SELinux","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":5}
{"created_at":"2020-04-19T18:27:15.330Z","updated_at":"2020-04-19T18:27:16.363Z","created_by":"elastic","description":"Linux Persistence via Account Creation","enabled":true,"false_positives":[],"from":"now-360s","id":"6e442258-306f-4212-a170-50131bddaf8e","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"f3ec164d-b7bc-4263-a390-bbb90d9be21d","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":25,"name":"Linux Persistence via Account Creation","query":"process.name: (adduser or useradd or usermod) and event.action: executed","references":[],"saved_id":"Linux Persistence via Account Creation","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"technique":[{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"}]}],"version":1}
{"created_at":"2020-04-19T18:27:42.413Z","updated_at":"2020-04-19T18:28:47.600Z","created_by":"elastic","description":"Linux Persistence via Account Creation","enabled":true,"false_positives":[],"from":"now-360s","id":"06d47b7a-48e1-487b-a0a4-2a577d1d9c08","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"c11912e3-063d-4010-a22d-1930f11189a7","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":75,"name":"Linux Persistence via Root UID Creation","query":"process.args: \"-g\" or \"-u\" and process.args: \"-o\" and process.name: useradd and event.action: executed","references":[],"saved_id":"Linux Persistence via Root UID Creation","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1136","name":"Create Account","id":"T1136"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence","id":"TA0003"}}],"version":2}
{"created_at":"2020-04-19T19:26:20.009Z","updated_at":"2020-04-19T19:26:21.051Z","created_by":"elastic","description":"Linux Persistence via Kernel Module Load\n","enabled":true,"false_positives":[],"from":"now-360s","id":"d34a55bb-bee0-444d-884f-5359ada0e047","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"8d9e5c93-ffa9-441b-b2a6-8f4f59689ad8","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":74,"name":"Linux Persistence via Kernel Module Load","query":"process.name: (insmond or modprobe) and not process.args: (\"--remove\" or \"-r\") and event.action:executed","references":[],"saved_id":"Linux Persistence via Kernel Module Load","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"technique":[{"id":"T1215","name":"Kernel Modules and Extensions","reference":"https://attack.mitre.org/techniques/T1215"}]}],"version":1}
{"created_at":"2020-04-19T19:26:34.094Z","updated_at":"2020-04-19T19:27:26.248Z","created_by":"elastic","description":"Linux Persistence via Kernel Module Rename","enabled":true,"false_positives":[],"from":"now-360s","id":"67b1d8d9-bcee-4b8b-9984-3247b54ca5b1","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"7be06b03-3eaf-4f76-b0ee-66c0bad95d7e","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":74,"name":"Linux Persistence via Kernel Module Rename","query":"process.name: modprobe and process.args: \"-o\" and event.action:executed","references":[],"saved_id":"Linux Persistence via Renamed Kernel Module","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1215","name":"Kernel Modules and Extensions","id":"T1215"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence","id":"TA0003"}}],"version":2}
{"created_at":"2020-04-19T19:31:08.013Z","updated_at":"2020-04-19T19:31:09.062Z","created_by":"elastic","description":"Linux System Discovery - Kernel Module Enumeration\n","enabled":true,"false_positives":[],"from":"now-360s","id":"0e064c8a-a166-46b2-bc38-f493a2d007a0","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"1a83ac04-bd5b-4383-85bd-877daf650e21","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Linux System Discovery - Kernel Module Enumeration","query":"(process.name: kmod and process.args: list) or process.name: (depmod or lsmod or modinfo)  and event.action:executed","references":[],"saved_id":"Linux System Discovery - Kernel Module Enumeration","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"technique":[{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082"}]}],"version":1}
{"created_at":"2020-04-19T19:29:05.536Z","updated_at":"2020-04-19T19:29:06.558Z","created_by":"elastic","description":"Linux Defense Evasion via Kernel Module Removal\n","enabled":true,"false_positives":[],"from":"now-360s","id":"66633d85-fa02-49e7-bed2-6440922bea0f","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"9c8e17d4-3e67-4166-a1bb-6050d0729534","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":74,"name":"Linux Defense Evasion via Kernel Module Removal","query":"((process.name: modprobe and process.args: \"-r\") or process.name: rmmod and event.action:executed)","references":[],"saved_id":"Linux Defense Evasion via Kernel Module Removal","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1089","name":"Disabling Security Tools","reference":"https://attack.mitre.org/techniques/T1089"}]}],"version":1}
{"created_at":"2020-04-19T19:37:59.807Z","updated_at":"2020-04-19T19:38:00.845Z","created_by":"elastic","description":"Linux Complier Activity","enabled":true,"false_positives":[],"from":"now-360s","id":"4792b7ee-1ac2-492d-8875-a6efe9e4e848","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"d3faa7b3-d6b1-4ef6-a3c1-9d228308cc5b","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":25,"name":"Linux Complier Activity","query":"process.name: (compile or gcc or make or yasm) and event.action: executed","references":[],"saved_id":"Linux Complier Activity","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"technique":[{"id":"T1127","name":"Trusted Developer Utilities","reference":"https://attack.mitre.org/techniques/T1127"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1127","name":"Trusted Developer Utilities","reference":"https://attack.mitre.org/techniques/T1127"}],"framework":"MITRE ATT&CK"}],"version":1}
{"created_at":"2020-04-19T19:59:50.008Z","updated_at":"2020-04-19T19:59:51.061Z","created_by":"elastic","description":"Linux Persistence via the SetUID Parameter\n","enabled":true,"false_positives":[],"from":"now-360s","id":"5fd29e2d-bede-4077-85b2-3d224e6b3611","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"364d8a8b-03d2-497b-9964-b57314cce6e3","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Linux Persistence via the SetUID Parameter","query":"process.args: \"u+s\" and process.name: chmod and event.action:executed","references":[],"saved_id":"Linux Persistence via the SetUID Parameter","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"technique":[{"id":"T1166","name":"Setuid and Setgid","reference":"https://attack.mitre.org/techniques/T1166"}]}],"version":1}
{"created_at":"2020-04-19T20:00:04.092Z","updated_at":"2020-04-19T20:00:58.354Z","created_by":"elastic","description":"Linux Persistence via the SetGID Parameter\n","enabled":true,"false_positives":[],"from":"now-360s","id":"bb329c3c-1cd1-46b1-b976-7212a8af72be","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"d33c1475-325c-42e0-8f15-cf05d4e302f3","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Linux Persistence via the SetGID Parameter","query":"process.args: \"g+s\" and process.name: chmod and event.action:executed","references":[],"saved_id":"Linux Persistence via the SetGID Parameter","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1166","name":"Setuid and Setgid","id":"T1166"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence","id":"TA0003"}}],"version":2}
{"created_at":"2020-04-19T20:01:26.547Z","updated_at":"2020-04-19T20:02:45.744Z","created_by":"elastic","description":"Linux Persistence via Systemd Service Creation","enabled":true,"false_positives":[],"from":"now-360s","id":"968da072-602a-47ed-a499-1caee3e53ce7","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"c9c59ed8-5a52-45d8-bf99-206147eb2a1b","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Linux Persistence via Systemd Service Creation","query":"process.args: enable and process.name: systemctl and event.action:executed","references":[],"saved_id":"Linux Persistence via Systemd Service Creation","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1501","name":"Systemd Service","id":"T1501"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence","id":"TA0003"}}],"version":3}
{"created_at":"2020-04-19T20:03:48.978Z","updated_at":"2020-04-19T21:11:01.184Z","created_by":"elastic","description":"Defense Evasion - Systemd Service Tampering","enabled":true,"false_positives":[],"from":"now-360s","id":"fbb0f886-047d-48fe-a9ae-9a4e6fc269f3","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"16c6d772-e97f-428c-93f2-002dffbce624","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":22,"name":"Defense Evasion - Systemd Service Tampering","query":"process.args: (disable or stop) and process.name: systemctl and event.action:executed","references":[],"saved_id":"Defense Evasion via Systemd Service Tampering","meta":{"from":"1m"},"severity":"low","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"created_at":"2020-04-19T21:23:26.150Z","updated_at":"2020-04-19T21:25:22.530Z","created_by":"elastic","description":"Defense Evasion - Attempt to Disable IPtables Firewall","enabled":true,"false_positives":[],"from":"now-360s","id":"0fae5efd-e882-4988-911a-2ac64170a2c0","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"b135c618-39b0-43dd-9f21-7dcaa6479df2","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":48,"name":"Defense Evasion - Attempt to Disable IPtables Firewall","query":"((process.name:service and process.args: stop) or (process.name: chkconfig and process.args: off) and process.args: (iptables or ip6tables) or (process.name: systemctl and process.args: firewalld and process.args: (disable or stop)))","references":[],"saved_id":"Defense Evasion - Attempt to Disable IPtables Firewall","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"created_at":"2020-04-19T21:38:08.532Z","updated_at":"2020-04-19T21:39:24.831Z","created_by":"elastic","description":"Defense Evasion - Attempt to Disable Syslog","enabled":true,"false_positives":[],"from":"now-360s","id":"7b96ae56-3d9f-4989-8db5-0dd24c76f3b4","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"8799b60c-d6cb-4651-82de-d09d50027174","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":48,"name":"Defense Evasion - Attempt to Disable Syslog","query":"(((process.name:service and process.args: stop) or (process.name: chkconfig and process.args: off) and (process.args: rsyslog)) or (process.name: systemctl and process.args: rsyslog) and process.args: (disable or stop))","references":[],"saved_id":"Defense Evasion - Disabling Syslog","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1089","name":"Disabling Security Tools","id":"T1089"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":4}
{"created_at":"2020-04-19T21:49:26.541Z","updated_at":"2020-04-19T22:38:05.131Z","created_by":"elastic","description":"Defense Evasion - File Destruction","enabled":true,"false_positives":[],"from":"now-360s","id":"5fbadee3-7239-4911-b266-3241c01a112a","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"aae4a854-1572-45f2-bf27-9bcfdc42120a","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":76,"name":"Defense Evasion - File Destruction","query":"process.name: shred and process.args: \"-u\" and event.action:executed","references":[],"saved_id":"Defense Evasion - File Destruction","meta":{"from":"1m"},"severity":"high","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1107","name":"File Deletion","id":"T1107"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"created_at":"2020-04-19T21:56:51.341Z","updated_at":"2020-04-19T22:38:53.330Z","created_by":"elastic","description":"Potential Defense Evasion via Time-stomping","enabled":true,"false_positives":[],"from":"now-360s","id":"a70682c3-632d-48c2-a917-facdb655fef0","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"b832c7e2-0f5b-42cf-baf7-5690e2855578","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Potential Defense Evasion via Time-stomping","query":"process.name: touch and event.action:executed","references":[],"saved_id":"Potential Defense Evasion via Time-stomping","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1099","name":"Timestomp","id":"T1099"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"version":3}
{"created_at":"2020-04-19T22:24:53.027Z","updated_at":"2020-04-19T22:39:32.464Z","created_by":"elastic","description":"Data Encryption - Possible Exfiltration\n","enabled":true,"false_positives":[],"from":"now-360s","id":"3972301d-747c-476c-a709-f2aafa82b3be","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"bb6742a0-dfb5-45d6-bc1a-5a2b16ef4387","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Data Encryption - Possible Exfiltration","query":"((process.name: zip) and (process.args: (\"-e\" or \"--password\")) or (process.name: gpg))","references":[],"saved_id":"Data Encryption - Possible Exfiltration","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1002","name":"Data Compressed","id":"T1002"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration","id":"TA0010"}}],"version":3}
{"created_at":"2020-04-19T22:33:03.019Z","updated_at":"2020-04-19T22:40:00.555Z","created_by":"elastic","description":"Network Activity by a Telnet Process","enabled":true,"false_positives":[],"from":"now-360s","id":"caee0420-ad34-452c-b892-ba86fea31bfa","immutable":false,"index":["auditbeat-*"],"interval":"5m","rule_id":"c5fff2f9-c221-4b32-9bda-bb8ef5a7291d","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":50,"name":"Network Activity by a Telnet Process","query":"process.name: telnet and event.action: (\"connected-to\" or \"network_flow\") and not destination.ip: 127.0.0.0/8 and destination.ip: *","references":[],"saved_id":"Telnet Activity","meta":{"from":"1m"},"severity":"medium","updated_by":"elastic","tags":[],"to":"now","type":"saved_query","threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1065","name":"Uncommonly Used Port","id":"T1065"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011","name":"Command and Control","id":"TA0011"}}],"version":3}
{"exported_count":20,"missing_rules":[],"missing_rules_count":0}
